#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-eP8ugfuoe1PKH7Fu

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ansibleexec.aws_iam_role.role: Refreshing state... [id=ansibleexec_ECSTaskRole]
module.ansibleexec.aws_ecr_lifecycle_policy.lifecycle: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecr_repository.repository: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansibleexec]
module.ansibleexec.aws_ecr_repository_policy.policy: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecs_task_definition.task: Refreshing state... [id=ansibleexec]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansibleexec.aws_ecr_repository.repository has changed
  ~ resource "aws_ecr_repository" "repository" {
        id                   = "ansibleexec"
        name                 = "ansibleexec"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ansibleexec.aws_ecs_task_definition.task has changed
  ~ resource "aws_ecs_task_definition" "task" {
        id                       = "ansibleexec"
      + tags                     = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansibleexec.aws_iam_role.role has changed
  ~ resource "aws_iam_role" "role" {
        id                    = "ansibleexec_ECSTaskRole"
        name                  = "ansibleexec_ECSTaskRole"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ansibleexec.aws_ecr_lifecycle_policy.lifecycle will be destroyed
  # (because aws_ecr_lifecycle_policy.lifecycle is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "lifecycle" {
      - id          = "ansibleexec" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images after 1 day"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 1
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibleexec" -> null
    }

  # module.ansibleexec.aws_ecr_repository.repository will be destroyed
  # (because aws_ecr_repository.repository is not in configuration)
  - resource "aws_ecr_repository" "repository" {
      - arn                  = "arn:aws:ecr:us-east-1:531133914787:repository/ansibleexec" -> null
      - id                   = "ansibleexec" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "ansibleexec" -> null
      - registry_id          = "531133914787" -> null
      - repository_url       = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibleexec" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.ansibleexec.aws_ecr_repository_policy.policy will be destroyed
  # (because aws_ecr_repository_policy.policy is not in configuration)
  - resource "aws_ecr_repository_policy" "policy" {
      - id          = "ansibleexec" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListImages",
                          - "ecr:DeleteRepository",
                          - "ecr:BatchDeleteImage",
                          - "ecr:SetRepositoryPolicy",
                          - "ecr:DeleteRepositoryPolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::531133914787:user/testUser",
                            ]
                        }
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibleexec" -> null
    }

  # module.ansibleexec.aws_ecs_cluster.cluster will be destroyed
  # (because aws_ecs_cluster.cluster is not in configuration)
  - resource "aws_ecs_cluster" "cluster" {
      - arn                = "arn:aws:ecs:us-east-1:531133914787:cluster/ansibleexec" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansibleexec" -> null
      - name               = "ansibleexec" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.ansibleexec.aws_ecs_task_definition.task will be destroyed
  # (because aws_ecs_task_definition.task is not in configuration)
  - resource "aws_ecs_task_definition" "task" {
      - arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansibleexec:2" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibleexec:latest"
                  - mountPoints      = []
                  - name             = "ansibleexec"
                  - portMappings     = []
                  - volumesFrom      = []
                  - workingDirectory = "/var/ansibleexec"
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::531133914787:role/ansibleexec_ECSTaskRole" -> null
      - family                   = "ansibleexec" -> null
      - id                       = "ansibleexec" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.ansibleexec.aws_iam_role.role will be destroyed
  # (because aws_iam_role.role is not in configuration)
  - resource "aws_iam_role" "role" {
      - arn                   = "arn:aws:iam::531133914787:role/ansibleexec_ECSTaskRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecution"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-25T03:37:28Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ansibleexec_ECSTaskRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ansibleexec_ECSTaskRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2R2LB4IG7EY" -> null

      - inline_policy {}
    }

  # module.server.aws_instance.instance will be created
  + resource "aws_instance" "instance" {
      + ami                                  = "ami-0c02fb55956c7d316"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.server.aws_network_interface.netif will be created
  + resource "aws_network_interface" "netif" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "10.192.2.111",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "sg-05bd0031419bb91c5",
        ]
      + source_dest_check         = true
      + subnet_id                 = "subnet-072107252df3c7e87"
      + tags_all                  = (known after apply)

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 6 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*